{
  "Acolyte": "This is a person devoted to a religious life, typically serving as a priest, monk, or other religious practitioner.",
  "Acrobat": "This is a skilled performer of gymnastic feats.",
  "Advocate": "This is a person who publicly supports or recommends a particular cause or policy.",
  "Alchemist": "This is a person who practices medieval chemistry or tries to change ordinary metals into gold.",
  "Animal Trainer": "This is a person who trains animals for performance, obedience, or companionship.",
  "Antique Dealer": "This is a person who buys and sells antiques.",
  "Apothecary": "This is a person who prepares and sells medicines, drugs, and potions.",
  "Appraiser": "This is a person who assesses the value or quality of something.",
  "Apprentice": "This is a person who is learning a trade from a skilled employer, having agreed to work for a fixed period at low wages.",
  "Architect": "This is a person who designs buildings and in many if (Profession ==s also supervises their construction.",
  "Archivist": "This is a person who maintains and is in charge of archives.",
  "Armorer": "This is a person who makes or repairs armor.",
  "Arsonist": "This is a person who sets fire to property.",
  "Artisan": "This is a skilled worker who makes things by hand.",
  "Astrologer": "This is a person who claims to interpret the influence of the stars and planets on human affairs.",
  "Astronomer": "This is a person who studies celestial objects and phenomena.",
  "Auctioneer": "This is a person who conducts auctions by accepting bids and declaring goods sold.",
  "Baker": "This is a person who bakes bread and cakes, typically for sale.",
  "Banker": "This is a person who manages or owns a bank.",
  "Barber": "This is a person who cuts hair and shaves or trims beards as an occupation.",
  "Basket Maker": "This is a person who makes baskets.",
  "Bather": "This is a person who bathes, especially in public.",
  "Beautician": "This is a person who gives beauty treatments to clients.",
  "Beekeeper": "This is a person who keeps bees, especially to collect honey.",
  "Beer Merchant": "This is a person who sells beer.",
  "Beggar": "This is a person who lives by asking for money or food.",
  "Bell Maker": "This is a person who makes bells.",
  "Blacksmith": "This is a person who makes and repairs things in iron by hand.",
  "Bleacher": "This is a person who whitens or cleans by exposure to sunlight or by applying chemicals.",
  "Bookbinder": "This is a person who fastens the pages of a book together.",
  "Bookkeeper": "This is a person who keeps records of financial affairs.",
  "Bookseller": "This is a person who sells books.",
  "Bootblack": "This is a person who shines shoes for a living.",
  "Bounty Hunter": "This is a person who captures fugitives for a monetary reward.",
  "Bowyer/Fletcher": "This is a person who makes bows and arrows.",
  "Brewer": "This is a person who makes beer.",
  "Brick maker": "This is a person who makes bricks.",
  "Bricklayer": "This is a person who lays bricks to build walls and other structures.",
  "Brothel Keeper": "This is a person who runs a brothel.",
  "Buckle Maker": "This is a person who makes buckles.",
  "Bureaucrat": "This is a person who works in a bureaucracy.",
  "Burglar": "This is a person who commits burglary.",
  "Butcher": "This is a person who slaughters animals or prepares meat for sale.",
  "Cabinet maker": "This is a person who makes and repairs wooden cabinets and furniture.",
  "Calligrapher": "This is a person who writes beautifully and decoratively.",
  "Canvass Maker": "This is a person who makes canvases for paintings or sails for boats.",
  "Carpenter": "This is a person who makes and repairs wooden objects and structures.",
  "Cartographer": "This is a person who draws or produces maps.",
  "Cartwright": "This is a person who makes or repairs carts and wagons.",
  "Chandler (Candle Maker)": "This is a person who makes or sells candles.",
  "Cheese maker": "This is a person who makes cheese.",
  "Chef": "This is a professional cook, typically the chief cook in a restaurant or hotel.",
  "Chest Maker": "This is a person who makes chests.",
  "Child Care": "This is a person who takes care of children when their parents are not available.",
  "Chimney sweep": "This is a person who cleans chimneys.",
  "City/Town Guard": "This is a person who is responsible for maintaining law and order in a city or town.",
  "Civil Engineer": "This is a person who designs and oversees the construction of public works, such as roads, bridges, and dams.",
  "Clergy member": "This is a member of the clergy, especially a priest, minister, or religious leader.",
  "Clerk": "This is a person employed in an office or bank to keep records, accounts, and undertake other routine administrative duties.",
  "Clock Maker": "This is a person who makes or repairs clocks.",
  "Cloth Merchant": "This is a person who sells cloth.",
  "Coachman": "This is a person who drives a coach, typically as an employee.",
  "Cobbler": "This is a person who repairs shoes.",
  "Confidence Artist": "This is a person who cheats or tricks others by gaining their trust and persuading them to believe something that is not true.",
  "Cook": "This is a person who prepares food for eating.",
  "Cooper (barrel-maker)": "This is a person who makes or repairs barrels and casks.",
  "Copyist": "This is a person who makes copies of documents.",
  "Counterfeiter": "This is a person who makes counterfeit money or goods.",
  "Courtesan": "This is a prostitute, especially one with wealthy or upper-class clients.",
  "Courtier": "This is a person who attends a royal court as a companion or adviser to the king or queen.",
  "Cultist": "This is a member of a cult, especially one that is considered strange or dangerous.",
  "Curator": "This is a person who is in charge of a museum, library, or other collection, and who selects, organizes, and looks after the items in it.",
  "Custodian": "This is a person who has responsibility for or looks after something.",
  "Cutpurse": "This is a person who steals from the pockets or purses of others in public places.",
  "Dairy Seller": "This is a person who sells dairy products.",
  "Dancer": "This is a person who dances, especially as a profession or for entertainment.",
  "Dentist": "This is a person qualified to treat diseases and conditions that affect the teeth and gums.",
  "Diplomat": "This is a person who represents their country abroad, typically in an official capacity.",
  "Distiller": "This is a person who makes alcoholic spirits by distillation.",
  "Ditch Digger": "This is a person who digs ditches.",
  "Diver": "This is a person who swims underwater using a breathing apparatus.",
  "Doctor": "This is a person who is qualified to treat people who are ill or injured.",
  "Doctor, Licensed": "This is a licensed medical doctor.",
  "Doctor, Unlicensed": "This is a person who practices medicine without a license.",
  "Domestic Servant": "This is a person who is employed to work in another person\"s house, especially one who does cleaning and cooking.",
  "Dowser": "This is a person who searches for underground water or minerals using a divining rod.",
  "Dream Interpreter": "This is a person who interprets dreams.",
  "Dye Maker": "This is a person who makes dyes.",
  "Engineer": "This is a person who designs, builds, or maintains engines, machines, or public works.",
  "Engraver": "This is a person who cuts designs or lettering into metal, wood, or other materials.",
  "Envoy": "This is a messenger or representative, especially one on a diplomatic mission.",
  "Executioner": "This is a person who carries out a sentence of death on a legally condemned person.",
  "Falconer": "This is a person who keeps, trains, and flies falcons.",
  "Farmer": "This is a person who owns or manages a farm.",
  "Firefighter": "This is a person whose job is to extinguish fires.",
  "Fisherman": "This is a person who catches fish, especially as a commercial activity.",
  "Fishmonger": "This is a person who sells fish for food.",
  "Florist": "This is a person who sells flowers and plants.",
  "Forger": "This is a person who produces fraudulent copies or imitations.",
  "Fortuneteller": "This is a person who claims to be able to predict a person\"s future by mystical or supernatural means.",
  "Fuller": "This is a person who fulls cloth (cleans and thickens) by beating or trampling it in water.",
  "Furrier": "This is a person who makes or sells fur garments.",
  "Gambler": "This is a person who plays games of chance for money.",
  "Gardener": "This is a person who tends and cultivates a garden as a pastime or for a living.",
  "Gilder": "This is a person who applies a thin layer of gold or gold paint.",
  "Gladiator": "This is a person, typically a slave, prisoner, or professional, who fought in an arena for the entertainment of the public.",
  "Glassblower": "This is a person who blows glass.",
  "Glazier": "This is a person who fits glass into windows and doors.",
  "Glove Maker": "This is a person who makes gloves.",
  "Goldsmith": "This is a person who makes articles of gold.",
  "Gong Farmer": "This is a person who cleans cesspits.",
  "Grave Digger": "This is a person who digs graves.",
  "Grave Robber": "This is a person who robs graves.",
  "Grocer": "This is a person who sells food and other household goods.",
  "Guide": "This is a person who shows the way to others, especially one employed to show tourists around places of interest.",
  "Haberdasher": "This is a person who sells small items for sewing, such as buttons, ribbons, and zips.",
  "Hay Merchant": "This is a person who sells hay.",
  "Healer": "This is a person who restores health.",
  "Herbalist": "This is a person who collects or sells herbs, especially medicinal herbs.",
  "Hermit": "This is a person living in solitude as a religious discipline.",
  "Highwayman": "This is a person, typically on horseback, who robs travelers on a road.",
  "Historian": "This is a person who studies and writes about the past and is regarded as an authority on it.",
  "Hostler (Horse Groom)": "This is a person who takes care of horses.",
  "Hunter or Fowler": "This is a person who hunts wild animals or birds.",
  "Illuminator (Book Artist)": "This is a person who illuminates manuscripts.",
  "Indentured Servant": "This is a person who is bound by a contract to work for another for a specified time.",
  "Inn/Tavern Servant": "This is a person who works as a servant in an inn or tavern.",
  "Innkeeper": "This is a person who owns or manages an inn.",
  "Inventor": "This is a person who creates or devises a new process, system, or machine.",
  "Investigator": "This is a person who carries out a formal inquiry or investigation.",
  "Jailer": "This is a person who is in charge of a jail.",
  "Jester": "This is a person who entertains others by jokes, tricks, or absurd behavior.",
  "Jeweler": "This is a person who makes, repairs, and sells jewelry.",
  "Journeyman": "This is a skilled worker who has completed an apprenticeship and is therefore recognized as being competent at a certain trade but not yet a master.",
  "Judge": "This is a person who presides over a court of law.",
  "Juggler": "This is a person who can keep several objects in motion in the air at the same time by alternately tossing and catching them.",
  "Kennel Master": "This is a person who looks after a kennel of dogs.",
  "Knight": "This is a man who served his sovereign or lord as a mounted soldier in armor.",
  "Laborer": "This is a person engaged in physical work, especially of an unskilled kind.",
  "Lamp maker": "This is a person who makes lamps.",
  "Lamplighter": "This is a person who lights street lamps.",
  "Launderer": "This is a person who washes and irons clothes and linens for others.",
  "Leatherworker": "This is a person who makes things from leather.",
  "Librarian": "This is a person who works in a library.",
  "Lightbearer": "This is a person who carries or gives out light.",
  "Linguist": "This is a person skilled in foreign languages.",
  "Livestock Merchant": "This is a person who trades in livestock.",
  "Locksmith": "This is a person who makes and repairs locks.",
  "Lumberjack": "This is a person who cuts down trees and cuts them into logs.",
  "Magic Merchant": "This is a person who sells magical items.",
  "Maid": "This is a female domestic servant.",
  "Mason": "This is a person who works in stone, building walls and structures.",
  "Mathematician": "This is a person who is an expert in mathematics.",
  "Mercenary": "This is a person primarily concerned with making money at the expense of ethics.",
  "Merchant": "This is a person who buys and sells goods, especially in large quantities, for profit.",
  "Metallurgist": "This is a person who is an expert in the science of metals.",
  "Midwife/husband": "This is a person who assists women in childbirth.",
  "Milkmaid/lad": "This is a person who milks cows.",
  "Miller": "This is a person who owns or works in a mill, especially a grain mill.",
  "Mime": "This is a person who performs mime.",
  "Miner": "This is a person who works in a mine, especially a coal mine.",
  "Minstrel": "This is a medieval singer or musician, especially one who sang or recited lyric or heroic poetry to a musical accompaniment for the nobility.",
  "Moneychanger": "This is a person who exchanges one currency for another.",
  "Moneylender": "This is a person who lends money at interest.",
  "Monk": "This is a member of a religious community of men typically living under vows of poverty, chastity, and obedience.",
  "Monster Trapper": "This is a person who captures monsters.",
  "Mortician": "This is a person who prepares dead bodies for burial or cremation and makes funeral arrangements.",
  "Mummer": "This is a person who wears a mask or fantastic costume while entertaining others.",
  "Musical Instrument Maker": "This is a person who makes musical instruments.",
  "Musician": "This is a person who plays a musical instrument, especially as a profession, or is musically talented.",
  "Navigator": "This is a person who directs the route or course of a ship, aircraft, or other form of transportation.",
  "Net maker": "This is a person who makes nets.",
  "Noble": "This is a person belonging to a hereditary class with high social or political status.",
  "Notary": "This is a person authorized to perform certain legal formalities, especially to draw up or certify contracts, deeds, and other documents for use in other jurisdictions.",
  "Orphan": "This is a child whose parents are dead.",
  "Outlaw": "This is a person who has broken the law and is hiding or living outside the law.",
  "Painter": "This is a person who paints buildings or walls as a trade.",
  "Paper/Parchment Maker": "This is a person who makes paper or parchment.",
  "Pastrycook": "This is a person who makes and sells pastry.",
  "Pathfinder": "This is a person who finds or makes a path, route, or way, especially through a previously unexplored or uncultivated country.",
  "Pawnbroker": "This is a person who lends money at interest on the security of an article pawned.",
  "Perfumer": "This is a person who makes or sells perfumes.",
  "Philosopher": "This is a person engaged or learned in philosophy.",
  "Pirate": "This is a person who attacks and robs ships at sea.",
  "Plasterer": "This is a person who applies plaster to walls, ceilings, or other structures.",
  "Poet": "This is a person who writes poems.",
  "Politician": "This is a person who is professionally involved in politics, especially as a holder of or a candidate for an elected office.",
  "Porter/Courier": "This is a person who carries items for others, especially as a job.",
  "Potionmaker": "This is a person who makes potions, especially magical or medicinal ones.",
  "Potter": "This is a person who makes pots.",
  "Private Guard": "This is a person employed to protect the person or property of another.",
  "Professor": "This is a person who teaches or conducts research at a university or college.",
  "Prospector": "This is a person who searches for mineral deposits, especially by drilling and excavation.",
  "Prostitute": "This is a person who engages in sexual activity for payment.",
  "Puppeteer": "This is a person who manipulates puppets, typically as entertainment.",
  "Rake": "This is a fashionable or wealthy man of immoral or promiscuous habits.",
  "Ratcatcher": "This is a person who catches rats, especially for a living.",
  "Restaurateur": "This is a person who owns or manages a restaurant.",
  "Rope Maker": "This is a person who makes rope.",
  "Rug Maker": "This is a person who makes rugs.",
  "Saboteur": "This is a person who engages in sabotage.",
  "Saddle maker": "This is a person who makes saddles.",
  "Saddler": "This is a person who makes and repairs saddles and harnesses for horses.",
  "Sage": "This is a wise and respected person.",
  "Sage/scholar": "This is a person who is knowledgeable in a particular field.",
  "Sail maker": "This is a person who makes or repairs sails.",
  "Sailor": "This is a person who works as a member of the crew of a commercial or naval ship.",
  "Salter": "This is a person who prepares or treats food with salt.",
  "Sapper": "This is a soldier responsible for tasks such as building and repairing roads and bridges, laying and clearing mines, etc.",
  "Scabbard Maker": "This is a person who makes scabbards.",
  "Scout": "This is a person sent out ahead of a main force to gather information about the enemy\"s position, strength, or movements.",
  "Scribe": "This is a person who copies out documents, especially one employed to do this before printing was invented.",
  "Sculptor": "This is a person who creates sculptures.",
  "Servant": "This is a person who performs duties for others, especially a person employed in a house or as a personal attendant.",
  "Server (inn/tavern/restaurant)": "This is a person who serves food or drinks in a restaurant or bar.",
  "Shepherd": "This is a person who herds and tends sheep.",
  "Shipwright": "This is a person who builds and repairs ships.",
  "Sign Maker": "This is a person who makes signs.",
  "Silversmith": "This is a person who makes articles from silver.",
  "Singer / Bard": "This is a person who sings, especially professionally.",
  "Skinner": "This is a person who removes the skin from animals.",
  "Smuggler": "This is a person who moves goods illegally into or out of a country.",
  "Soap Maker": "This is a person who makes soap.",
  "Soldier": "This is a person who serves in an army.",
  "Spice Merchant": "This is a person who sells spices.",
  "Squire": "This is a young nobleman acting as an attendant to a knight before becoming a knight himself.",
  "Stablehand": "This is a person who works in a stable.",
  "Steward / Majordomo": "This is a person who manages another\"s property or household.",
  "Storyteller": "This is a person who tells stories.",
  "Street cleaner": "This is a person employed to clean the streets.",
  "Student": "This is a person who is studying at a school or college.",
  "Surveyor": "This is a person who examines and records the area and features of an area of land, including its elevations, boundaries, and natural and man-made features.",
  "Swineherd": "This is a person who tends pigs.",
  "Tailor": "This is a person who makes, repairs, or alters clothing professionally, especially suits and men\"s clothing.",
  "Tanner": "This is a person who converts animal hides into leather by soaking them in a solution of tannin.",
  "Tattoo Artist": "This is a person who applies tattoos to the skin.",
  "Tavern Keeper": "This is a person who keeps or manages a tavern.",
  "Tax Collector": "This is a person who collects taxes.",
  "Taxidermist": "This is a person who prepares, stuffs, and mounts the skins of animals.",
  "Teacher": "This is a person who teaches, especially in a school.",
  "Tent maker": "This is a person who makes tents.",
  "Thatcher/Roofer": "This is a person who covers roofs with thatch or a similar material.",
  "Thug": "This is a violent person, especially a criminal.",
  "Tiler": "This is a person who lays tiles.",
  "Tinker": "This is a person who travels from place to place mending metal utensils as a way of making a living.",
  "Tobacco Merchant": "This is a person who sells tobacco.",
  "Torturer": "This is a person who inflicts severe pain on someone as a punishment or to force them to do or say something.",
  "Town Crier": "This is a person who makes public announcements in the streets.",
  "Toy Maker": "This is a person who makes toys.",
  "Trapper": "This is a person who sets traps for animals.",
  "Undertaker": "This is a person whose business is to prepare dead bodies for burial or cremation and to arrange funerals.",
  "Urchin": "This is a mischievous young child, especially one who is poorly or raggedly dressed.",
  "Vagabond": "This is a person who wanders from place to place without a home or job.",
  "Vintner": "This is a person who sells wine.",
  "Wainwright": "This is a person who builds or repairs vehicles, especially carts and wagons.",
  "Warehouse Worker": "This is a person who works in a warehouse.",
  "Watchman": "This is a person who keeps watch, especially at night.",
  "Water Carrier": "This is a person who carries and distributes water.",
  "Weaponsmith": "This is a person who makes weapons.",
  "Weaver": "This is a person who weaves fabric.",
  "Wetnurse": "This is a woman employed to suckle another woman\"s child.",
  "Wheelwright": "This is a person who makes and repairs wheels and wheeled vehicles.",
  "Wig maker": "This is a person who makes wigs.",
  "Woodcarver": "This is a person who carves wood.",
  "Woodseller": "This is a person who sells wood.",
  "Wool Merchant": "This is a person who sells wool.",
  "Writer": "This is a person who has written a particular text."
}